       IDENTIFICATION DIVISION.
       PROGRAM-ID. CGIUTIL.
       WORKING-STORAGE SECTION.
       01 TEMP-FIELDS.
          05 FIRST-PARAMETER-PAIR PIC X(25).
          05 REMAINDING-PARAMETERS PIC X(25).
          05 CURRENT-PARAMETER-NAME PIC X(10).
          05 CURRENT-PARAMETER-VALUE PIC X(10).
          05 PARAMETER-VALUE PIC X(10).
          05 PARAMETER-FOUND-SWITCH PIC X VALUE ZERO.
             88 PARAMETER-NOT-FOUND VALUE 0.
             88 PARAMETER-FOUND VALUE 1.
          05 NO-PARAMETER-REMAINDING-SWITCH PIC X VALUE ZERO.
             88 PARAMETER-REMAINDING VALUE 0.
             88 NO-PARAMETER-REMAINDING VALUE 1.
          05 COUNTER PIC 9(3).
          05 CURRENT-AMPERSAND-POSITION PIC 9(3).
          05 LENGTH-OF-TARGET PIC 9(03).
       LINKAGE SECTION.
       01 CHUNK-OF-POST PIC X(300).
       01 PARAMETER-NAME PIC X(10).
       PROCEDURE DIVISION USING CHUNK-OF-POST PARAMETER-NAME.
           GOBACK
          .
       SPLIT-ON-AMPERSAND SECTION.
           INITIALIZE CURRENT-AMPERSAND-POSITION
                      FIRST-PARAMETER-PAIR
                      REMAINDING-PARAMETERS
           PERFORM VARYING COUNTER FROM 1 BY 1 UNTIL
              COUNTER > LENGTH OF CHUNK-OF-POST

              EVALUATE CHUNK-OF-POST(COUNTER:1)
              WHEN "&"
                 MOVE COUNTER TO CURRENT-AMPERSAND-POSITION
                 EXIT PERFORM
              WHEN SPACES
                 EXIT PERFORM
              WHEN OTHER
                 CONTINUE
              END-EVALUATE
            END-PERFORM
           IF CURRENT-AMPERSAND-POSITION = ZERO THEN
              IF CHUNK-OF-POST = SPACES
                 SET NO-PARAMETER-REMAINDING TO TRUE
              ELSE
                 MOVE CHUNK-OF-POST TO FIRST-PARAMETER-PAIR
              END-IF
           ELSE
              MOVE CHUNK-OF-POST (1:CURRENT-AMPERSAND-POSITION - 1)
                TO FIRST-PARAMETER-PAIR
              COMPUTE LENGTH-OF-TARGET = LENGTH OF CHUNK-OF-POST
              MOVE CHUNK-OF-POST
                   (CURRENT-AMPERSAND-POSITION + 1 : LENGTH-OF-TARGET)
                TO REMAINDING-PARAMETERS
           END-IF

           EXIT.
       CHECK-PARAMETER-PAIR SECTION.
            UNSTRING FIRST-PARAMETER-PAIR
            DELIMITED BY "="
             INTO CURRENT-PARAMETER-NAME
                  CURRENT-PARAMETER-VALUE

             IF CURRENT-PARAMETER-NAME = PARAMETER-NAME THEN
                SET PARAMETER-FOUND TO TRUE
                MOVE CURRENT-PARAMETER-VALUE TO PARAMETER-VALUE
             END-IF
           EXIT.
       PARSE-PARAMETER SECTION.
           INITIALIZE TEMP-FIELDS

           PERFORM WITH TEST AFTER UNTIL
             NO-PARAMETER-REMAINDING OR PARAMETER-FOUND

             PERFORM SPLIT-ON-AMPERSAND

             PERFORM CHECK-PARAMETER-PAIR

              MOVE REMAINDING-PARAMETERS
                TO CHUNK-OF-POST
           END-PERFORM

           EXIT.
       END PROGRAM CGIUTIL.
