       01 REQUEST-PARAMETERS.
           05 REQUEST-STRING PIC X(1024).
           05 PARAMETER-NAME PIC X(10).
           05 PARAMETER-VALUE PIC X(35).
