       IDENTIFICATION DIVISION.
       PROGRAM-ID. CGIUTIL-DRIVER.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
        01 REQUEST-PARAMETERS.
            05 CHUNK-OF-POST PIC X(300).
            05 PARAMETER-NAME PIC X(10).
            05 PARAMETER-VALUE PIC X(10).
       PROCEDURE DIVISION.
           CALL 'CGIUTIL' USING REQUEST-PARAMETERS
           GOBACK.
